In [ ]:
import pandas as pd
import os

In [6]:
# List of High Schools
high_schools = ["Huang High School", "Hernandez High School", "Figueroa High School", "Shelton High School","Griffin High School"]

In [7]:
# Add the Pandas dependancy
import pandas as pd

In [9]:
# Create Pandas series from a list
school_series = pd.Series(high_schools)
school_series

0        Huang High School
1    Hernandez High School
2     Figueroa High School
3      Shelton High School
4      Griffin High School
dtype: object

In [14]:
for series in school_series:
    print(series)

Huang High School
Hernandez High School
Figueroa High School
Shelton High School
Griffin High School

In [15]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [16]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [17]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [18]:
# Initialize a new data frame
schools_df = pd.DataFrame()

In [20]:
# Add lists to DataFrame
schools_df["Schools ID"] = school_id
schools_df["School Name"] = school_name
schools_df["School Type"] = type_of_school

# Print DataFrame
schools_df

   Schools ID            School Name School Type
0           0      Huang High School    District
1           1   Figueroa High School    District
2           2    Shelton High School     Charter
3           3  Hernandez High School    District
4           4    Griffin High School     Charter

In [21]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [22]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [24]:
# Create a DataFrame from a dictionary
schools_df = pd.DataFrame(high_schools_dict)
schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [25]:
# Get names of columns via .columns
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [26]:
# Get number of index' via .index
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
# Get all values via .values
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [ ]:
student_data = os.